# -*-coding: utf-8 -*-

# 데이터 타입
string = "Hello String"
newList = [1,2.3,4]
number = 711
newDict = {"A":23, "B":"@@"}

# 개념
datastructure = """
  내가 어떤 자료구조를 택해서 어떤문제를 어떻게 풀것이냐가 관건이면
  내가 이용하는 자료구조가 어떤 성질인가에 대해 초점을 맞춰야한다 .

  자료구조라함은 어떤 데이터가 있고 그 데이터에 대해서 행할 수 있는 연산들이 있는 무엇인가의 구조
  연산이라함은 최대값을 찾거나 특정위치에 새로운 원소를 집어넣거나 삭제하는 등을 말하는 것.
"""

algorithm = """
  1. 사전적: 어떤 문제를 해결하기 위한 절차 방법 명령어
  2. 프로그래밍: 주어진 문제의 해결을 위한 자료구조와 연산방법에 대한 선택
"""

solution = """
해결하고자 하는 문제에 따라(응용종류와 범위에 따라) 최적의 해법은 서로 다르다!

이런 선택을 어떻게 해야하느냐를 알기위해 자료구조를 알고, 이해하고 있어야한다.
"""

print(string, newList, newDict, number);
